{
  "log_io": {
    "enabled": true,
    "log_dir": "logs/io",
    "request_file_pattern": "{run_name}__{attempt}__request.json",
    "response_file_pattern": "{run_name}__{attempt}__response.json"
  },
  "runs": [
    {
      "name": "expense_tracker_story",
      "profile_file": "context_files/profiles/openai/story_generator.json",
      "task_description": "The application must persist all data in a single human readable JSON file at a configurable path for example data slash expenses dot json storing a top level object with an expenses array each expense has id date in YYYY dash MM dash DD amount as a positive decimal category as a string from the allowed set and an optional description string and a settings object containing at minimum the currency code for example PLN; on startup if the file does not exist or is invalid the application must create or reset it to a safe default structure consisting of an empty expenses array and default settings; all modifications must follow a read modify write flow where the repository layer for example an ExpenseRepository class is solely responsible for loading and saving JSON so that business logic never accesses the filesystem directly; writes must be atomic meaning the program writes to a temporary file and then replaces the original to avoid corruption; the path to the JSON file must come from a small configuration module or constant so it can be changed without touching business logic; the JSON output must be pretty printed with stable field names to make it easy to inspect validate and regenerate by automated tools.",
      "context_file": [
        "context_files/general/story_example.txt",
        "context_files/general/story_rules.json"
      ],
      "target_file": "expense_tracker/story_expense_tracer.txt",
      "allowed_actions": ["file_write"],
      "retry": 0,
      "agent_input": {}
    },
    {
      "name": "story_validator",
      "profile_file": "context_files/profiles/openai/story_validator.json",
      "task_description": "Validate the generated implementation story against strict story rules. Write a validation report and, if needed, request a rerun that refines the story.",
      "context_file": [
        "expense_tracker/story_expense_tracer.txt",
        "context_files/general/story_rules.json"
      ],
      "target_file": "expense_tracker/story_validation.json",

      "rerun_index": 0,
      "target_run": "expense_tracker_story",
      "rerun_strategy": "context_files/strategies/story_rerun_strategy.json",

      "allowed_actions": ["file_write", "rerun", "continue", "break"],
      "retry": 0,
      "agent_input": {}
    }
  ]
}
