{"mode":"strict","metadata":{"system_name":"task_manager","domain":"task_management","source_story_type":"application_story","version":"v1"},"sections":[{"name":"App Story","content":"A local, offline command-line application that manages projects and tasks stored as JSON on the user's computer; each task belongs to a project and users can set task status (todo, in_progress, done) and priority (low, medium, high). The application persists data locally as JSON between runs."},{"name":"User Interaction","content":"Run the program with: python taskmgr.py '<json_command>' where the single CLI argument is a JSON string describing exactly one operation; the program performs that operation and prints a single JSON object result to stdout. Exit codes are deterministic: 0 on success, 2 for user/validation/not-found/conflict errors, and 1 for internal errors."},{"name":"Architecture","content":"The program runs fully offline, performs exactly one operation per execution, and produces deterministic observable outputs; behavior is repeatable and no network or remote services are required."},{"name":"Data and Persistence","content":"Projects and tasks are persisted locally in JSON files in a local data directory; each entity is stored as an array of records in its own JSON file. All write operations are atomic: on failure no partial changes are persisted."},{"name":"Identity and ID Policy","content":"Records use explicit ids provided by the caller; ids must be unique within their entity. Tasks reference their parent project by project id; the application validates referential integrity on create and update."},{"name":"CRUD Operations","content":"Supports create, list, get, update, and delete for projects and tasks. Task records include fields for id, title, project_id, status (allowed: todo, in_progress, done), and priority (allowed: low, medium, high). The application prevents deleting a project that still has tasks and returns a conflict error. All operations are atomic and return appropriate user-level errors for missing, invalid, or conflicting input."}]}