{
  "runs": [
    {
      "profile_name": "code_generation",
      "class_name": "tetris_game/renderer.py",
      "task_description": "Implement the Renderer class for a terminal-based Tetris game in the file tetris_game/renderer.py.\n\nThe Renderer class must follow the contract defined below. Use this JSON specification as the single source of truth for fields, methods, and their responsibilities. Implement ONLY the Renderer class and any minimal private helpers it needs. Assume other components such as Board, Tetromino, GameLoop, and InputHandler are implemented in their own modules and can be imported and used.\n\nDo NOT change any public names (class name, field names, method names). Do NOT change parameter lists or return types. Focus on clean, readable Python code for terminal rendering.\n\nPROJECT AND RENDERER SPECIFICATION (JSON CONTRACT):\n\n{\n  \"project_name\": \"Tetris Game\",\n  \"description\": \"A terminal-based Tetris game implemented in Python, featuring a modular architecture with separate concerns for configuration, tetromino handling, board state, rendering, input, and the main game loop.\",\n  \"language\": \"python\",\n  \"root_path\": \"./tetris_game\",\n  \"modules\": [\n    {\n      \"module_name\": \"renderer\",\n      \"description\": \"Handles rendering of the game state to the terminal or another output device.\",\n      \"classes\": [\n        {\n          \"class_name\": \"Renderer\",\n          \"file_path\": \"./tetris_game/renderer.py\",\n          \"description\": \"Renders the game board and tetrominos to the user by translating the Board state and active piece into characters or symbols.\",\n          \"fields\": [],\n          \"methods\": [\n            {\n              \"name\": \"render\",\n              \"description\": \"Renders the current game state to the terminal, using the Board grid and the active Tetromino position and shape.\",\n              \"parameters\": [\n                {\n                  \"name\": \"board\",\n                  \"type\": \"Board\",\n                  \"description\": \"The Board instance whose grid should be rendered as the background state.\"\n                },\n                {\n                  \"name\": \"tetromino\",\n                  \"type\": \"Tetromino\",\n                  \"description\": \"The active Tetromino instance that should be drawn on top of the board grid at its current position.\"\n                }\n              ],\n              \"returns\": \"None\"\n            }\n          ]\n        }\n      ]\n    }\n  ]\n}\n\nImplementation rules:\n- Implement the Renderer class exactly as specified above.\n- Use simple terminal rendering (e.g. characters like '#', '.', etc.) to represent occupied and empty cells.\n- Do not modify the Board or Tetromino instances; only read their state.\n- Do not handle input or game timing here; that is the responsibility of GameLoop and InputHandler.\n- You may add small private helper methods (e.g. to build a combined frame buffer) but must not change the public API.\n- Do not write any top-level executable code; only the class definition and any internal helpers.",
      "extra_params": {
        "target_path": "tetris_game/renderer.py"
      }
    }
  ]
}
