{
  "relationship_rules": {
    "entry_point_rules": [
      "Every application MUST have exactly one entry point class with role = 'entry_point'.",
      "The entry point class MUST be located in main.py.",
      "The entry point class is responsible for wiring dependencies and starting the application.",
      "The entry point MUST NOT contain business logic; it only orchestrates initialization and invokes the top-level operation."
    ],

    "directionality_rules": [
      "All dependencies MUST be directed caller → callee.",
      "If class A invokes a method on class B at runtime, A.depends_on MUST include B.",
      "Reverse or bidirectional dependencies MUST NOT be invented."
    ],

    "interaction_rules": [
      "Only the calling class may declare an interaction.",
      "An interaction MUST correspond to a real runtime method invocation.",
      "Every interaction target MUST also appear in depends_on.",
      "Interactions MUST NOT exist without a corresponding depends_on entry."
    ],

    "dependency_semantics_rules": [
      "depends_on MUST represent runtime call dependencies only.",
      "Type-only references (annotations, data shapes, serialization) MUST NOT appear in depends_on.",
      "If a class is referenced only as a data type, it MUST be excluded from depends_on."
    ],

    "domain_model_rules": [
      "Domain model classes MUST be passive data holders.",
      "Domain models MUST NOT declare interactions.",
      "Domain models MUST NOT appear in depends_on unless their methods are invoked at runtime."
    ],

    "parameter_ownership_rules": [
      "If an interaction crosses a component boundary using parameters (e.g., path, config, locale), parameter ownership MUST be explicit.",
      "Each such parameter MUST be modeled as either: (a) constructor-injected state, (b) method-level parameter, or (c) constant owned by a specific component.",
      "A generator MUST NOT invent parameter flow or ownership not described in relationship.json."
    ],

    "consistency_rules": [
      "depends_on and interactions MUST describe the same directed call graph.",
      "There MUST be no interaction whose target is missing from depends_on.",
      "There MUST be no depends_on entry without at least one corresponding interaction."
    ],

    "derived_field_rules": [
      "used_by is a derived field and MUST NOT be authored by generators.",
      "If present, used_by MUST be ignored and recomputed from depends_on."
    ],

    "example_usage_rules": [
      "Example relationship JSON files are FORMAT-ONLY.",
      "Examples MUST NOT influence architecture, layering, naming, or dependency choices.",
      "No module paths, class roles, or patterns from examples may be copied."
    ],

    "error_severity_rules": {
      "levels": {
        "minor": "Local, correctable issues. Structure is valid. Intent is understood.",
        "major": "Multiple violations or partial misunderstanding. Structure exists but is unreliable.",
        "fatal": "Invalid JSON, schema totally broken, or intent misunderstood."
      },
      "routing": {
        "minor": "refiner",
        "major": "refiner",
        "fatal": "remake"
      }
    }
  }
}