{
  "ruleset": "py_run_generator_basic_rules",
  "version": "1.1.0",

  "principles": [
    "The manifest is the only source of truth. Do not invent, infer, defer, or transform anything.",
    "All values must be taken verbatim from the manifest (class.id, class.file_path, class.class_name, metadata.system_name).",
    "Namespaces, module paths, and file paths MUST NOT be renamed, rewritten, normalized, or relocated.",
    "File paths MUST NOT be modified in any way (no added folders, no removed folders, no extension changes).",
    "If any required value is missing or ambiguous, the generator MUST fail deterministically by emitting zero runs and a clear explanatory note."
  ],

  "strict_no_todo_policy": [
    "The run generator MUST NOT introduce TODOs, placeholders, deferred instructions, or undecided behavior.",
    "The run generator MUST NOT emit TODOs in task_description, notes, or any other field.",
    "If information is insufficient to generate a deterministic run, the generator MUST fail instead of emitting TODOs."
  ],

  "project_name": {
    "resolution_order": [
      "metadata.system_name",
      "metadata.project_name",
      "metadata.name"
    ],
    "no_guessing": true,
    "failure_mode": "If project_name cannot be resolved, emit zero runs and explain the missing field in notes."
  },

  "class_selection": {
    "source": "manifest.classes",
    "include_only_file_paths_ending_with": ".py"
  },

  "run_generation": {
    "one_run_per_class": true,

    "run_name_rule": "run.name MUST be deterministic and derived from class.id by replacing all non-alphanumeric characters with '_'",

    "profile_file": "context_files/profiles/python/openai-5/coders/py_generator.json",
    "provider": "openai",

    "context_files": [
      "example/manifest/manifest.json",
      "context_files/general_rules/python_rules.json"
    ],

    "target_file_rule": "target_file MUST equal project_name + '/' + class.file_path, both taken verbatim from the manifest.",

    "task_description_rules": [
      "Task description MUST be minimal and imperative.",
      "Task description MUST instruct only: 'Create the Python file at <target_file>.'",
      "Task description MUST NOT include architectural, semantic, or behavioral instructions.",
      "All coding rules, constraints, and expectations are supplied exclusively via context files.",
      "Task description MUST NOT mention TODOs, placeholders, assumptions, or future work."
    ]
  },

  "overwrite_risk": {
    "shared_file_path_policy": [
      "If multiple classes map to the same file_path, the generator MUST emit exactly ONE run for that file_path.",
      "That run MUST instruct the coder to create exactly one module file containing ALL classes mapped to that file_path.",
      "No additional classes may be included, and no classes may be omitted."
    ]
  }
}
